Revit 2017 API
StructuralSectionLAngle Class
 Defines parameters for L-angle Flange structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionLAngle : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionLAngle _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionLAngle : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle
See Also
StructuralSectionLAngle Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace